# Article recommendor: Non personalised

In [297]:
import numpy as np
import pandas as pd

In [298]:
data=pd.read_csv('train.csv')

In [299]:
data.head()

   user_id  article_id  rating
0        1         456       1
1        1        2934       1
2        1          82       1
3        1        1365       1
4        1         221       1

In [300]:
data['rating'].min()

1

In [301]:
data.user_id.max()

1087

In [302]:
data.isna().sum()

user_id       0
article_id    0
rating        0
dtype: int64

In [303]:
data.shape

(16731, 3)

In [304]:
data.user_id.nunique()

907

In [305]:
#5% of total unique users
907*5/100

45.35

In [306]:
group1=data.groupby(['article_id'])

In [307]:
total_user=group1['rating'].count()
mean_rated=group1['rating'].mean()

In [308]:
df=pd.concat([total_user,mean_rated],axis=1)

In [309]:
df.columns=['total_count','mean_rating']

In [310]:
df_=df[df['total_count']>45.35]

# Top 10 Article based on the rating provided by more than 5% users

In [311]:
df_.sort_values('mean_rating',ascending=False)[:10]

            total_count  mean_rating
article_id
580                  48     1.833333
1249                 58     1.706897
2781                 60     1.700000
1433                 61     1.639344
967                 122     1.442623
221                  64     1.421875
618                  50     1.420000
1755                 54     1.407407
456                  69     1.391304
2388                 52     1.384615

#top 10 article based on the user feedback more than 5% of user given feedback

In [312]:
df

            total_count  mean_rating
article_id
1                     2     1.500000
3                     7     1.000000
4                     9     2.555556
5                     1     2.000000
6                    12     1.500000
...                 ...          ...
2969                 12     1.916667
2970                  9     1.222222
2974                  7     1.428571
2975                  1     1.000000
2976                 35     1.400000

[2529 rows x 2 columns]

# Top 10 read article given that avg rating above 1.5

In [314]:
df__=df[df['mean_rating']>1.5].sort_values('total_count',ascending=False)[:10]
df__

            total_count  mean_rating
article_id
1433                 61     1.639344
2781                 60     1.700000
1249                 58     1.706897
580                  48     1.833333
2361                 42     1.523810
1366                 41     1.731707
2178                 38     1.578947
2248                 35     1.514286
1716                 34     1.794118
1614                 33     1.515152

# Top 10 article based on the weighted rating

In [317]:
#mean rating of all the articles
round(df['mean_rating'].mean(),2)

1.49

In [324]:
df_w=df[df['total_count']>=2]
df_w

            total_count  mean_rating
article_id
1                     2     1.500000
3                     7     1.000000
4                     9     2.555556
6                    12     1.500000
7                     4     1.000000
...                 ...          ...
2968                 23     1.565217
2969                 12     1.916667
2970                  9     1.222222
2974                  7     1.428571
2976                 35     1.400000

[2026 rows x 2 columns]

In [344]:
#calculation of weight
df_w['w']=(df['mean_rating']*df['total_count']+1.49*2)/(df['total_count']+2)

<ipython-input-344-0efcbf7a5a4b>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_w['w']=(df['mean_rating']*df['total_count']+1.49*2)/(df['total_count']+2)

In [345]:
df_w

            total_count  mean_rating         w
article_id
1                     2     1.500000  1.495000
3                     7     1.000000  1.108889
4                     9     2.555556  2.361818
6                    12     1.500000  1.498571
7                     4     1.000000  1.163333
...                 ...          ...       ...
2968                 23     1.565217  1.559200
2969                 12     1.916667  1.855714
2970                  9     1.222222  1.270909
2974                  7     1.428571  1.442222
2976                 35     1.400000  1.404865

[2026 rows x 3 columns]

In [348]:
df_w.sort_values('w',ascending=False)[:10]

            total_count  mean_rating         w
article_id
2283                  2     5.000000  3.245000
239                   2     5.000000  3.245000
2141                  4     4.000000  3.163333
129                   4     4.000000  3.163333
2779                  6     3.666667  3.122500
931                   8     3.500000  3.098000
24                    3     4.000000  2.996000
739                   3     4.000000  2.996000
861                   2     4.500000  2.995000
2079                  6     3.333333  2.872500